fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_АктыПоВыполненнымРаботам</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_АктыПоВыполненнымРаботам/ВКМ_АктыПоВыполненнымРаботам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_АктыПоВыполненнымРаботам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПроведения(Отказ, Режим) 
		
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачалаДействия, ВКМ_ДатаОкончанияДействия, ВКМ_СтоимостьЧасаРаботы");
	ВидДоговора = РеквизитыДоговора.ВидДоговора;
	ДатаНачала = РеквизитыДоговора.ВКМ_ДатаНачалаДействия;
	ДатаОкончания = РеквизитыДоговора.ВКМ_ДатаОкончанияДействия;
	СтавкаЧаса = РеквизитыДоговора.ВКМ_СтоимостьЧасаРаботы;
	ДанныеСотрудника = ВКМ_ДанныеСотрудниковВызовСервера.ДанныеСотрудника(Специалист, Дата);
	КатегорияСотрудника = ДанныеСотрудника.Категория;
	ПроцентОтПродаж = ДанныеСотрудника.ПроцентОтРабот;
	
	Если КатегорияСотрудника <> Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Выбран сотрудник не из категории Специалист.", ЭтотОбъект, "Специалист");
		Возврат;	
	КонецЕсли;
	
	Если ПроцентОтПродаж = "" Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для специалиста %1 на дату документа не установлен процент оплаты от работ.", Специалист), ЭтотОбъект, "Специалист");
		Возврат;
	КонецЕсли;
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание  Тогда 
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Выбран неверный договор. Договор должен быть с типом Абонентское обслуживание", ЭтотОбъект, "Договор");
		Возврат;
	КонецЕсли;	
	
	Если Дата < ДатаНачала ИЛИ Дата > ДатаОкончания Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("На дату документа договор не действителен. Проверьте срок действия договора", ЭтотОбъект, "Договор");
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_АктыПоВыполненнымРаботам.Записывать= Истина;
	
	ВсегоЧасовКОплате = 0;
	СуммаВсего = 0;
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * СтавкаЧаса;
		
		ВсегоЧасовКОплате = ВсегоЧасовКОплате + Строка.ЧасыКОплатеКлиенту;
		СуммаВсего = СуммаВсего + Движение.СуммаКОплате;
		
	КонецЦикла;
	
	Если ВыполненныеРаботы.Количество() <> 0 Тогда
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВсегоЧасовКОплате;
		Движение.СуммаКОплате = ВсегоЧасовКОплате * СтавкаЧаса * Число(СокрЛП(ПроцентОтПродаж)) / 100;
		
		// регистр ВКМ_АктыПоВыполненнымРаботам Приход
		Движение = Движения.ВКМ_АктыПоВыполненнымРаботам.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.Сумма = СуммаВсего;
		
	КонецЕсли; 
		
КонецПроцедуры 
	
#КонецОбласти 
	
#КонецЕсли
